Revit 2027 API
ParameterTypeId.PropertySegmentDistance Property
 "Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PropertySegmentDistance { get; }
Public Shared ReadOnly Property PropertySegmentDistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PropertySegmentDistance {
	ForgeTypeId^ get ();
}
static member PropertySegmentDistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace